import { defineStore } from 'pinia';

export const useStore = defineStore({
  id: 'data',
  state() {
    return {
      topNews: [
        {
          id: 1,
          title:
            'Які українські телеканали стали доступні на відкритому супутнику  12,5 тонн гуманітарної допомогі ',
          date: '7 березня',
          tag: '#війна',
          image: 'topnews1',
        },
        {
          id: 2,
          title:
            'Благодійний фонд «Ти не один 1+1 media» отримали і передають 12,5 тонн гуманітарної допомогі',
          date: '25 березня',
          tag: '#ведучі1+1',
          image: 'topnews2',
        },
        {
          id: 3,
          title:
            'Українське телебачення закордоном: як підключитись за допомогою супутникаб корисні поради  ',
          date: '13 березня',
          tag: '#війна',
          image: 'topnews3',
        },
        {
          id: 4,
          title:
            'Матеріали для Гааги: 1+1 media збирає всю інформацію про злочини РФ і війну в  містах України    ',
          date: '26 лютого',
          tag: '#війна',
          image: 'topnews4',
        },
        {
          id: 4,
          title:
            'Матеріали для Гааги: 1+1 media збирає всю інформацію про злочини РФ і війну в  містах України    ',
          date: '26 лютого',
          tag: '#війна',
          image: 'intnews3',
        },
      ],
      intNews: [
        {
          id: 1,
          title:
            'Що відбувається з психікою після перегляду жахливих кадрів звільненої Київщини та як подолати спустошення: поради від психологині Світлани Ройз  ',
          date: '7 березня',
          tag: '#війна',
          image: 'intnews1',
        },
        {
          id: 2,
          title:
            'Щоденники війни: кореспондентка ТСН Ірина Маркевич розповіла про свій будинок, який пограбували і спалили окупанти',
          date: '25 березня',
          tag: '#ведучі1+1',
          image: 'intnews2',
        },
        {
          id: 3,
          title:
            '"Я би хотів продовжити свій рід", – співак та ведучий Коля Сєрга у «Сніданку з 1+1» розповів, як боронить Україну та про мрії після війни  ',
          date: '13 березня',
          tag: '#війна',
          image: 'intnews3',
        },
        {
          id: 4,
          title:
            'Планетарна війна 5-6 квітня: чому астрологи називають ці дні небезпечними ',
          date: '26 лютого',
          tag: '#війна',
          image: 'topnews1',
        },
        {
          id: 4,
          title:
            'Гороскоп на 5 квітня для всіх знаків зодіаку: ціна за найдорожче завжди висока',
          date: '26 лютого',
          tag: '#війна',
          image: 'lastnews1',
        },
      ],
      lastNews: [
        {
          id: 1,
          title:
            '"Нам не пощастило із сусідом дуже давно, але жодного разу росіянам не вдалося нас знищити" — журналістка ТСН Юлія Кирієнко',
          date: '7 березня',
          tag: '#війна',
          image: 'lastnews1',
        },
        {
          id: 2,
          title:
            'Благодійний фонд «Ти не один 1+1 media» отримали і передають 12,5 тонн гуманітарної допомогі',
          date: '25 березня',
          tag: '#ведучі1+1',
          image: 'lastnews2',
        },
        {
          id: 3,
          title:
            'Лідія Таран розповіла про зустріч у Люксембурзі з Альоною Загребою: дівчиною, яка знімала відеощоденник блокадного Маріуполя ',
          date: '13 березня',
          tag: '#війна',
          image: 'lastnews3',
        },
        {
          id: 4,
          title:
            '«Я тримаю удар разом зі своїм народом», – акторка Ірма Вітовська ексклюзивно для «ЖВЛ» розповіла про свою волонтерську діяльність під час війни та свої істинні цінності ',
          date: '26 лютого',
          tag: '#війна',
          image: 'lastnews1',
        },
        {
          id: 4,
          title:
            'Тренерка «Голосу країни-12» Олександра Заріцька показала свої дитячі фото з Харкова: «Місто вільних, талановитих людей»  ',
          date: '26 лютого',
          tag: '#війна',
          image: 'intnews1',
        },
      ],
      mainNews: [
        {
          id: 1,
          title:
            'Як з режиму виживання перейти в режим життя: поради психологині Анни Кушнерук  ',
          date: '2 квітня',
          tag: '#війна',
          image: 'mainnews1',
        },
        {
          id: 1,
          title:
            'Чому росія віками цинічно зазіхає на нашу історію та культурну спадщину: злочини та міфи москви (історичні фільми “Україна. Повернення своєї історії”)  ',
          date: '2 квітня',
          tag: '#війна',
          image: 'mainnews4',
        },
        {
          id: 1,
          title:
            'Сонячне затемнення в Україні у 2022: коли буде та до чого готуватися ',
          date: '2 квітня',
          tag: '#війна',
          image: 'mainnews2',
        },
        {
          id: 1,
          title:
            'Війна не перешкода: у 20 областях України стартувала посівна   ',
          date: '2 квітня',
          tag: '#війна',
          image: 'mainnews3',
        },
      ],
      moreNews: [
        {
          id: 1,
          title:
            'Рідкісний кадр: Святослав Вакарчук разом з донькою-волонтеркою у Львові',
          date: '21 лютого',
          tag: '#війна',
          image: 'nb2',
        },
        {
          id: 2,
          title:
            'В Охматдиті пройшов традиційний п’ятничний благодійний концерт: пацієнтів та лікарів підтримали ведуча 1+1 Соломія Вітвіцька, співак Віталій Козловський та ряд молодих артистів',

          date: '21 лютого',
          tag: '#війна',
          image: 'nb1',
        },
        {
          id: 3,
          title:
            'Український хлопчик, з яким Анджеліна Джолі зустрілась в італійській лікарні, став підопічним благодійного проєкту «Здійсни мрію',
          date: '21 лютого',
          tag: '#війна',
          image: 'nb3',
        },
        {
          id: 4,
          title:
            'Офіційно: Kalush Orchestra виступлять на Євробаченні-2022 наживо і відвідають промоконцерти напередодні пісенного конкурсу',
          tag: '#війна',
          image: 'nb4',
        },
        {
          id: 5,
          title:
            'Модель світового рівня, українець Лев Улесов став військовим медиком територіальної оборони: подробиці у «Сніданку. Онлайн»',
          date: '21 лютого',
          tag: '#війна',
          image: 'celebrity3',
        },
      ],
      celebrityNews: [
        {
          id: 1,
          title:
            'Оля Полякова у "Світському житті" прокоментувала конкуренцію з іншими тренерами "Голосу країни" та розповіла про реакцію аудиторії на її участь у шоу',
          date: '21 лютого',
          tag: '#зірки',
          image: 'celebrity2',
        },
        {
          id: 2,
          title:
            '«Можливо, я дам згоду своєму чоловіку на третю дитину», – Катерина Кухар поділилася особистим зі «Світським життям»',
          date: '21 лютого',
          tag: '#зірки',
          image: 'celebrity1',
        },
        {
          id: 3,
          title:
            'Артур Логай розповів про страшні моменти під час верхової їзди на зйомках серіалу "Дім Бобринських',
          date: '21 лютого',
          tag: '#зірки',
          image: 'celebrity3',
        },
        {
          id: 4,
          title:
            'Чим здивував ведучий шоу «Твій день» Костянтин Грубич в інтервю для «Світського життя з Катериною Осадчою"',
          date: '21 лютого',
          tag: '#зірки',
          image: 'celebrity4',
        },
        {
          id: 5,
          title:
            'DOROFEEVA у «Світському житті» зізналася: «Нарешті я почала собі подобатися»',
          date: '21 лютого',
          tag: '#зірки',
          image: 'celebrity5',
        },
      ],
      beautyNews: [
        {
          id: 1,
          title:
            'Місячний календар стрижок на квітень 2022: сприятливі та несприятливі дні для наведення краси  ',
          date: '26 лютого',
          tag: '#краса',
          image: 'beauty1',
        },
        {
          id: 2,
          title:
            'Величезний прапор України на Mercedes Benz Fashion Week в Берліні: український дизайнер Жан Грицфельдт презентував колекцію, створену під час війни',
          date: '26 лютого',
          tag: '#краса',
          image: 'beauty2',
        },
        {
          id: 3,
          title:
            'Які джинси вийшли з моди та з чим поєднувати трендові широкі джинси (поради стилістки) ',
          date: '26 лютого',
          tag: '#краса',
          image: 'beauty3',
        },
        {
          id: 4,
          title:
            'Як очистити взуття від солі: шкіра, замша, нубук (пояснила майстриня з реставрації шкіри)   ',
          date: '26 лютого',
          tag: '#краса',
          image: 'beauty4',
        },
        {
          id: 5,
          title:
            'Замість шапки: стильні та теплі варіанти головних уборів на зиму (поради дизайнера Андре Тана) ',
          date: '26 лютого',
          tag: '#краса',
          image: 'beauty5',
        },
        {
          id: 6,
          title: 'Ідеї манікюру: лаконічні та ніжні дизайни ',
          date: '26 лютого',
          tag: '#краса',
          image: 'beauty6',
        },
      ],
      travelUA: [
        {
          id: 1,
          title:
            'Стародавні традиції гуцулів-сироварів та секрети виробництва карпатських ',
          image: 'tua1',
        },
        {
          id: 2,
          title:
            'Географічний центр Європи та шлях до місця народження гуцульського сиру ',
          image: 'tua2',
        },
        {
          id: 3,
          title:
            'Український Робінзон Крузо: як монах-відлюдник пристосувався до життя ',
          image: 'tua3',
        },
        {
          id: 4,
          title:
            'Що пов’язує маяк на острові Джарилгач з Ейфелевою вежею та Парижем  ',
          image: 'tua4',
        },
        {
          id: 5,
          title:
            'Як Дмитро Комаров і Олександр Дмитрієв відпочивали зі своїми сімями',
          image: 'tua5',
        },
        {
          id: 5,
          title:
            'Як Дмитро Комаров і Олександр Дмитрієв відпочивали зі своїми сімями',
          image: 'tua5',
        },
      ],
      videoPrograms: [
        {
          id: 1,
          day: 'Пн-Пт',
          time: '06:30',
          program: 'сніданок з 1+1',
          image: 'vp1',
        },
        {
          id: 2,
          day: 'Пн-Пт',
          time: '20:20',
          program: 'ліга сміху',
          image: 'vp2',
        },
        {
          id: 3,
          time: 'скоро',
          program: 'ліпсінк баптл',
          image: 'vp3',
        },
        {
          id: 4,
          day: 'Сб-Нд',
          time: '08:00',
          program: 'сніданок. вихідний',
          image: 'vp4',
        },
        {
          id: 5,
          day: 'з 7 лютого',
          time: '22:45',
          program: 'твій вечір',
          image: 'vp5',
        },
        {
          id: 6,
          day: 'Пн-Пт',
          time: '17:10',
          program: 'крила кохання',
          image: 'vp6',
        },
      ],
      telePrograms: [
        {
          time: '07:00',
          program: 'Новини',
        },
        {
          time: '09:00',
          program: 'Новини',
        },
        {
          time: '11:00',
          program: 'Новини',
        },
        {
          time: '13:00',
          program: 'Новини',
        },
        {
          time: '15:00',
          program: 'Новини',
        },
        {
          time: '18:00',
          program: 'Новини',
        },
        {
          time: '20:00',
          program: 'Новини',
        },
        {
          time: '21:00',
          program: 'Новини',
        },
        {
          time: '22:00',
          program: 'Новини',
        },
        {
          time: '00:00',
          program: 'Новини',
        },
      ],
      partnersLogo: [
        {
          id: 1,
          partner: 'partner-logo1',
          link: 'про канал',
        },
        {
          id: 2,
          partner: 'partner-logo2',
          link: 'кодування супутника',
        },
        {
          id: 3,
          partner: 'partner-logo3',
          link: 'реклама',
        },
        {
          id: 4,
          partner: 'partner-logo4',
          link: 'проблеми з каналом 1+1',
        },
        {
          id: 5,
          partner: 'partner-logo5',
          link: 'кастинги',
        },
        {
          id: 6,
          partner: 'partner-logo6',
          link: 'карєра',
        },
        {
          id: 7,
          partner: 'partner-logo7',
          link: 'ведучі',
        },
        {
          id: 8,
          partner: 'partner-logo8',
          link: 'структура власності',
        },
        {
          id: 9,
          partner: 'partner-logo9',
          link: 'політика конфіденційності',
        },
      ],
    };
  },
});
